[
  {
    "symbol": "star",
    "title": "Pro",
    "configurations": ["appstore"],
    "items": [
      {
        "title": "What features are unlocked?",
        "text": "Every plan unlocks all features the app has on the current device.\nDepending on the presented offer, a plan might support one (iOS/iPadOS or macOS) or all platforms."
      },
      {
        "title": "Why should I pay?",
        "text": "First and most by upgrading to Pro you gain full access to many of the app's features.\nThe app is continoulsy improved, extended with the new features, and optimized for better performance & efficiency.\nYour contribution supports further development of the app."
      },
      {
        "title": "Do I have to upgrade separately on iOS/iPadOS and macOS devices?",
        "text": "If a plan states that it is for all platforms, then you can use it on every device Usage supports (iOS/iPadOS/macOS). Otherwise, if a plan states it is for one platform, or does not state platform at all, assume it is only for the platform it is shown on (iOS/iPadOS or macOS)."
      },
      {
        "title": "Is there any limit on the amount of devices?",
        "text": "There are none.\nYou can reuse a plan across its supported platform(s) on all devices attached to the iCloud account."
      },
      {
        "title": "Is there a plan for family sharing?",
        "text": "No, not right now.\nI'm considering it for the future update. If you would prefer to have family sharing included, please do let me know."
      },
      {
        "title": "Why do I see different plans and prices than before?",
        "text": "Plans and prices are subject to change as I continuously run experiments."
      },
      {
        "title": "I made a purchase before, how do I get my Pro plan again?",
        "text": "On the purchase screen press the \"Restore purchases\" button."
      }
    ]
  },
  {
    "symbol": "menubar.rectangle",
    "title": "Menu",
    "platforms": ["macos"],
    "items": [
      {
        "title": "How to reorder items?",
        "text": "To reorder items in the system menu bar, press the command key and drag an item to the desired position.\nTo reorder elements within, open the Menu tab in the app, and drag an item to the desired position."
      },
      {
        "title": "Why is Menu enabled but its items are not visible?",
        "text": "Make sure there is enough space in the system menu bar.\nOtherwise try re-enabling the Menu feature."
      }
    ]
  },
  {
    "symbol": "icloud",
    "title": "Cloud Sync",
    "items": [
      {
        "title": "How quickly is the data synced?",
        "text": "Normally, the sync occurs approximately once every ten seconds if there is any data to send or download. In some cases, it might be paused due to low battery, limited space in iCloud, etc.\nYou should not expect it to be real-time or near to it.\nMy advice is to enable cloud sync only for the most relevant data sources."
      },
      {
        "title": "Can I rename a device?",
        "text": "Yes! Open Preferences tab, then in the iCloud sync section tap on the Options button (three dots) next to the device name, and click on the presented 'Rename' option."
      }
    ]
  },
  {
    "symbol": "rectangle.grid.1x2",
    "title": "Widgets",
    "items": [
      {
        "title": "Why sometimes information is displayed with a delay?",
        "text": "The refresh time of any widget (unless the reload button is tapped) is controlled by the system. The app only sets a preference for it, which in our case is once per minute.\nThe widgets by their purpose and design are not meant to be real-time and you naturally should not expect that.\nUsage app makes its best effort to show the most up-to-date information in every widget."
      },
      {
        "title": "Why tapping the reload button does not update the displayed information?",
        "text": "Tapping the reload button always fetches the latest stored information, and, if supported, refreshes the information not more often than once per minute."
      },
      {
        "title": "Why do some widgets require the main app to be open?",
        "text": "Currently, there are technical limitations to how some data is fetched, which makes it not possible to be refreshed from the limited widget's environment.",
        "platforms": ["macos"]
      },
      {
        "title": "Why there is no Network Activity widget?",
        "text": "Home Screen widgets and Live Activities on iOS/iPadOS do not have support for real-time updates required for live network connection monitoring.",
        "platforms": ["ios"]
      }
    ]
  },
  {
    "symbol": "slider.horizontal.3",
    "title": "Preferences",
    "items": [
      {
        "title": "How often is data refreshed?",
        "text": "Each data is refreshed at its own refresh interval. To view current refresh interval and to change it, open the Usage tab, and press the preferences icon next to each data source."
      },
      {
        "title": "Can I disable refresh for data source I'm not interested in?",
        "text": "Yes. Open preferences for the data source and set its refresh rate to 'Off'."
      },
      {
        "title": "Can I hide data source I'm not interested in?",
        "text": "Yes. Open preferences for the data source and set its refresh rate to 'Off'."
      },
      {
        "title": "How can I change temperature between Celsius and Fahrenheit?",
        "text": "On the Usage tab, press the preferences icon next to Battery Charge or Processor Temperature and change Display Unit to the preferred one.",
        "platforms": ["macos"]
      }
    ]
  },
  {
    "symbol": "plus.diamond",
    "title": "Helper",
    "platforms": ["macos"],
    "items": [
      {
        "title": "Why is it necessary?",
        "text": "The apps on the Mac App Store are sandboxed, which means they cannot read certain system sensors.\nThe Helper app can fetch more system information and exchange it with the Usage app."
      },
      {
        "title": "What does it enable?",
        "text": "It enables monitoring of processor temperature, fans, graphic card, and processes."
      },
      {
        "title": "I'm missing Processor Temperature monitoring",
        "text": "Install [the Helper](https://usage.pro/mac/helper) to enable monitoring for Processor Temperature."
      },
      {
        "title": "I'm missing Graphics monitoring",
        "text": "Install [the Helper](https://usage.pro/mac/helper) to enable monitoring for Graphics."
      },
      {
        "title": "I'm missing Fans monitoring",
        "text": "Install [the Helper](https://usage.pro/mac/helper) to enable monitoring for Fans."
      },
      {
        "title": "I'm missing Processes monitoring",
        "text": "Install [the Helper](https://usage.pro/mac/helper) to enable monitoring for Processes."
      },
      {
        "title": "I get an error when installing the Helper",
        "text": "A common error when installing the Helper is wrong permissions to the directories where it installs. To fix that you need to open the system's Terminal app and run these commands one-by-one, and then try again.\n\n`whoami`\n`sudo chown WRITE_HERE_USERNAME_FROM_PREVIOUS_COMMAND ~/Library/LaunchAgents/`\n`sudo chown WRITE_HERE_USERNAME_FROM_PREVIOUS_COMMAND ~/Library/Application Support/`\n\nIf this does not solve it, please get in touch!"
      },
      {
        "title": "How to uninstall the Helper?",
        "text": "Open 'Library/Application Support/Usage' and double click the 'uninstall' file. It will do everything necessary to remove the Helper completely."
      }
    ]
  },
  {
    "symbol": "lock.shield",
    "title": "Privacy",
    "items": [
      {
        "title": "Where is my data stored?",
        "text": "Data is stored locally on the device, and in your private iCloud container if cloud sync is enabled."
      },
      {
        "title": "Is there any personal identifying information tracked?",
        "text": "There is no personal identifying information tracked or anyhow used by the app."
      }
    ]
  },
  {
    "symbol": "list.bullet.rectangle.portrait",
    "title": "Terms",
    "items": [
      {
        "title": "Data Source",
        "text": "Data Source is each metrics the app monitors, i.e. Battery, Disk, Memory, etc."
      }
    ]
  }
]
